https://machinelearningmastery.com/train-test-split-for-evaluating-machine-learning-algorithms/

In [8]:
import pandas as pd

In [9]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}
pd.DataFrame(studentData)

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

In [11]:
comparison_df = pd.DataFrame(columns=['3_topics', '2_topics'])

comparison_df.loc['test'] = [1,2]

In [12]:
comparison_df

     3_topics 2_topics
test        1        2